; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p1-2 - location
	p2-3 - location
	p3-1 - location
	p3-5 - location
	p3-6 - location
	p3-7 - location
	p3-8 - location
	p3-9 - location
	p4-0 - location
	p4-1 - location
	p5-1 - location
	p6-3 - location
	p6-4 - location
	p6-10 - location
	p7-1 - location
	p7-2 - location
	p8-1 - location
	p8-2 - location
	p8-5 - location
	p8-7 - location
	p9-7 - location
	p10-2 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s5)
	(at driver3 s2)
	(at driver4 s9)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s9)
	(empty truck4)
	(at package1 s10)
	(at package2 s3)
	(at package3 s0)
	(at package4 s9)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 43)
	(= (time-to-walk p1-2 s1) 43)
	(= (time-to-walk s2 p1-2) 23)
	(= (time-to-walk p1-2 s2) 23)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 6)
	(= (time-to-walk p2-3 s2) 6)
	(= (time-to-walk s3 p2-3) 23)
	(= (time-to-walk p2-3 s3) 23)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 9)
	(= (time-to-walk p3-1 s3) 9)
	(= (time-to-walk s1 p3-1) 12)
	(= (time-to-walk p3-1 s1) 12)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 40)
	(= (time-to-walk p3-5 s3) 40)
	(= (time-to-walk s5 p3-5) 23)
	(= (time-to-walk p3-5 s5) 23)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 52)
	(= (time-to-walk p3-6 s3) 52)
	(= (time-to-walk s6 p3-6) 47)
	(= (time-to-walk p3-6 s6) 47)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 77)
	(= (time-to-walk p3-7 s3) 77)
	(= (time-to-walk s7 p3-7) 70)
	(= (time-to-walk p3-7 s7) 70)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(= (time-to-walk s3 p3-8) 88)
	(= (time-to-walk p3-8 s3) 88)
	(= (time-to-walk s8 p3-8) 1)
	(= (time-to-walk p3-8 s8) 1)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(= (time-to-walk s3 p3-9) 40)
	(= (time-to-walk p3-9 s3) 40)
	(= (time-to-walk s9 p3-9) 84)
	(= (time-to-walk p3-9 s9) 84)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 85)
	(= (time-to-walk p4-0 s4) 85)
	(= (time-to-walk s0 p4-0) 77)
	(= (time-to-walk p4-0 s0) 77)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 41)
	(= (time-to-walk p4-1 s4) 41)
	(= (time-to-walk s1 p4-1) 82)
	(= (time-to-walk p4-1 s1) 82)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 62)
	(= (time-to-walk p5-1 s5) 62)
	(= (time-to-walk s1 p5-1) 35)
	(= (time-to-walk p5-1 s1) 35)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 16)
	(= (time-to-walk p6-4 s6) 16)
	(= (time-to-walk s4 p6-4) 30)
	(= (time-to-walk p6-4 s4) 30)
	(path s6 p6-10)
	(path p6-10 s6)
	(path s10 p6-10)
	(path p6-10 s10)
	(= (time-to-walk s6 p6-10) 74)
	(= (time-to-walk p6-10 s6) 74)
	(= (time-to-walk s10 p6-10) 20)
	(= (time-to-walk p6-10 s10) 20)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 77)
	(= (time-to-walk p7-1 s7) 77)
	(= (time-to-walk s1 p7-1) 99)
	(= (time-to-walk p7-1 s1) 99)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 6)
	(= (time-to-walk p7-2 s7) 6)
	(= (time-to-walk s2 p7-2) 74)
	(= (time-to-walk p7-2 s2) 74)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 15)
	(= (time-to-walk p8-1 s8) 15)
	(= (time-to-walk s1 p8-1) 48)
	(= (time-to-walk p8-1 s1) 48)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 97)
	(= (time-to-walk p8-2 s8) 97)
	(= (time-to-walk s2 p8-2) 20)
	(= (time-to-walk p8-2 s2) 20)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(= (time-to-walk s8 p8-5) 71)
	(= (time-to-walk p8-5 s8) 71)
	(= (time-to-walk s5 p8-5) 5)
	(= (time-to-walk p8-5 s5) 5)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 32)
	(= (time-to-walk p8-7 s8) 32)
	(= (time-to-walk s7 p8-7) 11)
	(= (time-to-walk p8-7 s7) 11)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(= (time-to-walk s9 p9-7) 28)
	(= (time-to-walk p9-7 s9) 28)
	(= (time-to-walk s7 p9-7) 83)
	(= (time-to-walk p9-7 s7) 83)
	(path s10 p10-2)
	(path p10-2 s10)
	(path s2 p10-2)
	(path p10-2 s2)
	(= (time-to-walk s10 p10-2) 57)
	(= (time-to-walk p10-2 s10) 57)
	(= (time-to-walk s2 p10-2) 4)
	(= (time-to-walk p10-2 s2) 4)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 52)
	(= (time-to-drive s2 s0) 52)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 45)
	(= (time-to-drive s3 s0) 45)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 4)
	(= (time-to-drive s6 s0) 4)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 91)
	(= (time-to-drive s7 s0) 91)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 28)
	(= (time-to-drive s8 s0) 28)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 88)
	(= (time-to-drive s0 s1) 88)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 68)
	(= (time-to-drive s3 s1) 68)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 69)
	(= (time-to-drive s10 s1) 69)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 70)
	(= (time-to-drive s1 s2) 70)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 29)
	(= (time-to-drive s7 s2) 29)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 3)
	(= (time-to-drive s10 s2) 3)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 86)
	(= (time-to-drive s8 s3) 86)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 58)
	(= (time-to-drive s10 s3) 58)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 76)
	(= (time-to-drive s1 s4) 76)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 6)
	(= (time-to-drive s3 s4) 6)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 35)
	(= (time-to-drive s8 s4) 35)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 75)
	(= (time-to-drive s4 s5) 75)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 11)
	(= (time-to-drive s8 s5) 11)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 8)
	(= (time-to-drive s1 s6) 8)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 89)
	(= (time-to-drive s5 s7) 89)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 59)
	(= (time-to-drive s6 s7) 59)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 5)
	(= (time-to-drive s9 s7) 5)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 8)
	(= (time-to-drive s2 s9) 8)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 29)
	(= (time-to-drive s3 s9) 29)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 9)
	(= (time-to-drive s4 s9) 9)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 39)
	(= (time-to-drive s6 s9) 39)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 40)
	(= (time-to-drive s4 s10) 40)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 37)
	(= (time-to-drive s9 s10) 37)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s9)
	(at driver2 s10)
	(at driver3 s9)
	(at truck2 s1)
	(at truck3 s7)
	(at truck4 s4)
	(at package1 s9)
	(at package2 s7)
	(at package3 s5)
	(at package4 s10)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver4 truck4 s9)
   deleted: (at driver4 s9) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 0 of 10
2. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 0 of 10
3. (load-truck package4 truck4 s9)
   deleted: (at package4 s9)
   added: (in package4 truck4)
   goals met: 0 of 10
4. (drive-truck truck4 s9 s10 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s10)
   changed: (driven) from 0 to 37
   goals met: 0 of 10
5. (load-truck package1 truck4 s10)
   deleted: (at package1 s10)
   added: (in package1 truck4)
   goals met: 0 of 10
6. (unload-truck package4 truck4 s10)
   deleted: (in package4 truck4)
   added: (at package4 s10)
   goals met: 1 of 10
7. (drive-truck truck3 s2 s9 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (driven) from 37 to 45
   goals met: 1 of 10
8. (drive-truck truck4 s10 s4 driver4)
   deleted: (at truck4 s10)
   added: (at truck4 s4)
   changed: (driven) from 45 to 85
   goals met: 2 of 10
9. (disembark-truck driver3 truck3 s9)
   deleted: (driving driver3 truck3)
   added: (at driver3 s9) (empty truck3)
   goals met: 3 of 10
10. (drive-truck truck4 s4 s3 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (driven) from 85 to 91
   goals met: 2 of 10
11. (load-truck package2 truck4 s3)
   deleted: (at package2 s3)
   added: (in package2 truck4)
   goals met: 2 of 10
12. (drive-truck truck4 s3 s8 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s8)
   changed: (driven) from 91 to 177
   goals met: 2 of 10
13. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 10
14. (drive-truck truck4 s8 s5 driver4)
   deleted: (at truck4 s8)
   added: (at truck4 s5)
   changed: (driven) from 177 to 188
   goals met: 2 of 10
15. (drive-truck truck2 s5 s4 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 188 to 263
   goals met: 2 of 10
16. (drive-truck truck2 s4 s10 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (driven) from 263 to 303
   goals met: 2 of 10
17. (drive-truck truck4 s5 s7 driver4)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   changed: (driven) from 303 to 392
   goals met: 2 of 10
18. (unload-truck package2 truck4 s7)
   deleted: (in package2 truck4)
   added: (at package2 s7)
   goals met: 3 of 10
19. (walk driver1 s8 p3-8)
   deleted: (at driver1 s8)
   added: (at driver1 p3-8)
   changed: (walked) from 0 to 1
   goals met: 3 of 10
20. (walk driver1 p3-8 s3)
   deleted: (at driver1 p3-8)
   added: (at driver1 s3)
   changed: (walked) from 1 to 89
   goals met: 3 of 10
21. (walk driver1 s3 p3-9)
   deleted: (at driver1 s3)
   added: (at driver1 p3-9)
   changed: (walked) from 89 to 129
   goals met: 3 of 10
22. (walk driver1 p3-9 s9)
   deleted: (at driver1 p3-9)
   added: (at driver1 s9)
   changed: (walked) from 129 to 213
   goals met: 4 of 10
23. (drive-truck truck2 s10 s1 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s1)
   changed: (driven) from 392 to 461
   goals met: 5 of 10
24. (drive-truck truck4 s7 s9 driver4)
   deleted: (at truck4 s7)
   added: (at truck4 s9)
   changed: (driven) from 461 to 466
   goals met: 5 of 10
25. (unload-truck package1 truck4 s9)
   deleted: (in package1 truck4)
   added: (at package1 s9)
   goals met: 6 of 10
26. (board-truck driver1 truck3 s9)
   deleted: (at driver1 s9) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 10
27. (drive-truck truck3 s9 s7 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (driven) from 466 to 471
   goals met: 6 of 10
28. (drive-truck truck4 s9 s4 driver4)
   deleted: (at truck4 s9)
   added: (at truck4 s4)
   changed: (driven) from 471 to 480
   goals met: 7 of 10
29. (drive-truck truck3 s7 s0 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 480 to 571
   goals met: 6 of 10
30. (load-truck package3 truck3 s0)
   deleted: (at package3 s0)
   added: (in package3 truck3)
   goals met: 6 of 10
31. (drive-truck truck3 s0 s7 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   changed: (driven) from 571 to 662
   goals met: 7 of 10
32. (drive-truck truck3 s7 s5 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (driven) from 662 to 751
   goals met: 6 of 10
33. (unload-truck package3 truck3 s5)
   deleted: (in package3 truck3)
   added: (at package3 s5)
   goals met: 7 of 10
34. (drive-truck truck2 s1 s10 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s10)
   changed: (driven) from 751 to 820
   goals met: 6 of 10
35. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 6 of 10
36. (drive-truck truck4 s4 s9 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s9)
   changed: (driven) from 820 to 829
   goals met: 5 of 10
37. (disembark-truck driver2 truck2 s10)
   deleted: (driving driver2 truck2)
   added: (at driver2 s10) (empty truck2)
   goals met: 6 of 10
38. (walk driver1 s5 p3-5)
   deleted: (at driver1 s5)
   added: (at driver1 p3-5)
   changed: (walked) from 213 to 236
   goals met: 6 of 10
39. (walk driver1 p3-5 s3)
   deleted: (at driver1 p3-5)
   added: (at driver1 s3)
   changed: (walked) from 236 to 276
   goals met: 6 of 10
40. (walk driver1 s3 p3-9)
   deleted: (at driver1 s3)
   added: (at driver1 p3-9)
   changed: (walked) from 276 to 316
   goals met: 6 of 10
41. (walk driver1 p3-9 s9)
   deleted: (at driver1 p3-9)
   added: (at driver1 s9)
   changed: (walked) from 316 to 400
   goals met: 7 of 10
42. (disembark-truck driver4 truck4 s9)
   deleted: (driving driver4 truck4)
   added: (at driver4 s9) (empty truck4)
   goals met: 7 of 10
43. (board-truck driver1 truck4 s9)
   deleted: (at driver1 s9) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 6 of 10
44. (drive-truck truck4 s9 s4 driver1)
   deleted: (at truck4 s9)
   added: (at truck4 s4)
   changed: (driven) from 829 to 838
   goals met: 7 of 10
45. (board-truck driver2 truck2 s10)
   deleted: (at driver2 s10) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 10
46. (drive-truck truck4 s4 s5 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   changed: (driven) from 838 to 913
   goals met: 5 of 10
47. (disembark-truck driver1 truck4 s5)
   deleted: (driving driver1 truck4)
   added: (at driver1 s5) (empty truck4)
   goals met: 5 of 10
48. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 10
49. (drive-truck truck2 s10 s1 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s1)
   changed: (driven) from 913 to 982
   goals met: 6 of 10
50. (drive-truck truck3 s5 s7 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (driven) from 982 to 1071
   goals met: 7 of 10
51. (drive-truck truck3 s7 s9 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   changed: (driven) from 1071 to 1076
   goals met: 6 of 10
52. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 6 of 10
53. (disembark-truck driver1 truck3 s9)
   deleted: (driving driver1 truck3)
   added: (at driver1 s9) (empty truck3)
   goals met: 7 of 10
54. (walk driver2 s1 p5-1)
   deleted: (at driver2 s1)
   added: (at driver2 p5-1)
   changed: (walked) from 400 to 435
   goals met: 7 of 10
55. (board-truck driver4 truck3 s9)
   deleted: (at driver4 s9) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 7 of 10
56. (drive-truck truck3 s9 s7 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (driven) from 1076 to 1081
   goals met: 8 of 10
57. (walk driver2 p5-1 s5)
   deleted: (at driver2 p5-1)
   added: (at driver2 s5)
   changed: (walked) from 435 to 497
   goals met: 8 of 10
58. (drive-truck truck3 s7 s5 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (driven) from 1081 to 1170
   goals met: 7 of 10
59. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 7 of 10
60. (board-truck driver4 truck4 s5)
   deleted: (at driver4 s5) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 7 of 10
61. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 10
62. (drive-truck truck3 s5 s7 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (driven) from 1170 to 1259
   goals met: 8 of 10
63. (disembark-truck driver2 truck3 s7)
   deleted: (driving driver2 truck3)
   added: (at driver2 s7) (empty truck3)
   goals met: 8 of 10
64. (drive-truck truck4 s5 s4 driver4)
   deleted: (at truck4 s5)
   added: (at truck4 s4)
   changed: (driven) from 1259 to 1334
   goals met: 9 of 10
65. (walk driver2 s7 p7-2)
   deleted: (at driver2 s7)
   added: (at driver2 p7-2)
   changed: (walked) from 497 to 503
   goals met: 9 of 10
66. (walk driver2 p7-2 s2)
   deleted: (at driver2 p7-2)
   added: (at driver2 s2)
   changed: (walked) from 503 to 577
   goals met: 9 of 10
67. (walk driver2 s2 p10-2)
   deleted: (at driver2 s2)
   added: (at driver2 p10-2)
   changed: (walked) from 577 to 581
   goals met: 9 of 10
68. (walk driver2 p10-2 s10)
   deleted: (at driver2 p10-2)
   added: (at driver2 s10)
   changed: (walked) from 581 to 638
   goals met: 10 of 10
